_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
conv2d (Conv2D)              (None, 16, 16, 96)        2688
_________________________________________________________________
activation (Activation)      (None, 16, 16, 96)        0
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 8, 8, 96)          0
_________________________________________________________________
batch_normalization (BatchNo (None, 8, 8, 96)          384
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 8, 8, 256)         614656
_________________________________________________________________
activation_1 (Activation)    (None, 8, 8, 256)         0
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 4, 4, 256)         0
_________________________________________________________________
batch_normalization_1 (Batch (None, 4, 4, 256)         1024
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 4, 4, 384)         885120
_________________________________________________________________
activation_2 (Activation)    (None, 4, 4, 384)         0
_________________________________________________________________
batch_normalization_2 (Batch (None, 4, 4, 384)         1536
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 4, 4, 384)         1327488
_________________________________________________________________
activation_3 (Activation)    (None, 4, 4, 384)         0
_________________________________________________________________
batch_normalization_3 (Batch (None, 4, 4, 384)         1536
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 4, 4, 256)         884992
_________________________________________________________________
activation_4 (Activation)    (None, 4, 4, 256)         0
_________________________________________________________________
batch_normalization_4 (Batch (None, 4, 4, 256)         1024
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 1, 1, 256)         0
_________________________________________________________________
flatten (Flatten)            (None, 256)               0
_________________________________________________________________
dense (Dense)                (None, 1024)              263168
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0
_________________________________________________________________
dense_1 (Dense)              (None, 1024)              1049600
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0
_________________________________________________________________
dense_2 (Dense)              (None, 10)                10250
=================================================================
Total params: 5,043,466
Trainable params: 5,040,714
Non-trainable params: 2,752
_________________________________________________________________
